<?php

namespace app\common\constant;

class CommonConstant
{

    const COMPANY_DEVICE_MONITOR_TYPE = [
        1 => '其他',
        2 => '监控',
        3 => '感应',
    ];

    const DEVICE_MONITOR_STATE_ARR = [
        1 => '正常',
        2 => '异常',
        3 => '暂停',
        4 => '封存',
    ];


    /**
     * 安全标识色标
     */
    const SAFETY_IDENTITY_COLOR_ALL = [
        1 => '红',
        2 => '黄',
        3 => '蓝',
        4 => '绿',
    ];


    /**
     * 风险色标
     */
    const RISK_IDENTITY_COLOR_ALL = [
        1 => '红',
        2 => '橙',
        3 => '黄',
        4 => '蓝',
    ];


    /**
     * 事故等级
     */
    const ACCIDENT_LEVEL_ARR = [
        1 => '特别重大',
        2 => '重大',
        3 => '较大',
        4 => '一般',
        5 => '事件',
        6 => '不符合',
    ];

    /**
     * 事故类型
     */
    const ACCIDENT_TYPE_ARR = [
        1  => '物体打击',
        2  => '车辆伤害',
        3  => '机械伤害',
        4  => '起重伤害',
        5  => '触电',
        6  => '淹溺',
        7  => '灼烫',
        8  => '火灾',
        9  => '高处坠落',
        10 => '坍塌',
        11 => '冒顶片帮',
        12 => '透水',
        13 => '放炮（爆破）',
        14 => '瓦斯爆炸',
        15 => '火药爆炸',
        16 => '锅炉爆炸',
        17 => '容器爆炸',
        18 => '其他爆炸',
        19 => '中毒和窒息',
        20 => '其他伤害',
    ];


    /**
     * 不符合类型
     */
    const NONCONFORMING_TYPE_ARR = [
        1 => '人的行为',
        2 => '物的状态',
        3 => '环境不良',
    ];


    /**
     * 培训类型
     */
    const TRAIN_TYPE_ARR = [
        1 => '新员工培训',
        2 => '资质培训',
        3 => '日常培训',
    ];

    /**
     * 员工属性
     */
    const STAFF_ATTRIBUTE_ARR = [
        1 => '新员工(一个月)',
        2 => '一般员工',
        3 => '临时工',
    ];

    /**
     * 学习内容类别
     */
    const STUDY_CONTENT_ARR = [
        1  => '规章制度',
        2  => '操作规程',
        3  => '技术文件',
        4  => '技术标准',
        5  => '事故事件',
        6  => '法律法规',
        99 => '其他',
    ];


    /*
     * 区域权限配置
     */
    const AREA_PERMISSION_CONFIG = [
        1 => "区域权限",
        2 => "设施权限",
        3 => "摄像头",
        4 => "上岗位",
        5 => "点检位",
        6 => "巡检点",
        7 => "EHS监测点",
        8 => "有限空间",
        9 => "定位点",
    ];

}
