<?php

namespace app\common\constant;

class ObjectConstant
{

    /*
     * 危废类型
     */
    const HAZARDOUS_OBJECT = [
        1 => [
            'id'            => 1,
            'no'            => 'HW01',
            'name'          => '医疗废物',
        ],
        2 => [
            'id'            => 2,
            'no'            => 'HW02',
            'name'          => '医药废物',
        ],
        3 => [
            'id'            => 3,
            'no'            => 'HW03',
            'name'          => '废药物、药品',
        ],
        4 => [
            'id'            => 4,
            'no'            => 'HW04',
            'name'          => '农药废物',
        ],
        5 => [
            'id'            => 5,
            'no'            => 'HW05',
            'name'          => '木材防腐剂废物',
        ],
        6 => [
            'id'            => 6,
            'no'            => 'HW06',
            'name'          => '废有机溶剂与含有机溶剂废物',
        ],
        7 => [
            'id'            => 7,
            'no'            => 'HW07',
            'name'          => '热处理含氰废物',
        ],
        8 => [
            'id'            => 8,
            'no'            => 'HW08',
            'name'          => '废矿物油与含矿物油废物',
        ],
        9 => [
            'id'            => 9,
            'no'            => 'HW09',
            'name'          => '油/水、烃/水混合物或乳化液',
        ],
        10 => [
            'id'            => 10,
            'no'            => 'HW10',
            'name'          => '多氯（溴）联苯类废物',
        ],
        11 => [
            'id'            => 11,
            'no'            => 'HW11',
            'name'          => '精（蒸）馏残渣',
        ],
        12 => [
            'id'            => 12,
            'no'            => 'HW12',
            'name'          => '染料、涂料废物',
        ],
        13 => [
            'id'            => 13,
            'no'            => 'HW13',
            'name'          => '有机树脂类废物',
        ],
        14 => [
            'id'            => 14,
            'no'            => 'HW14',
            'name'          => '新化学物质废物',
        ],
        15 => [
            'id'            => 15,
            'no'            => 'HW15',
            'name'          => '爆炸性废物',
        ],
        16 => [
            'id'            => 16,
            'no'            => 'HW16',
            'name'          => '感光材料废物',
        ],
        17 => [
            'id'            => 17,
            'no'            => 'HW17',
            'name'          => '表面处理废物',
        ],
        18 => [
            'id'            => 18,
            'no'            => 'HW18',
            'name'          => '焚烧处置残渣',
        ],
        19 => [
            'id'            => 19,
            'no'            => 'HW19',
            'name'          => '含金属羰基化合物废物',
        ],
        20 => [
            'id'            => 20,
            'no'            => 'HW20',
            'name'          => '含铍废物',
        ],
        21 => [
            'id'            => 21,
            'no'            => 'HW21',
            'name'          => '含铬废物',
        ],
        22 => [
            'id'            => 22,
            'no'            => 'HW22',
            'name'          => '含铜废物',
        ],
        23 => [
            'id'            => 23,
            'no'            => 'HW23',
            'name'          => '含锌废物',
        ],
        24 => [
            'id'            => 24,
            'no'            => 'HW24',
            'name'          => '含砷废物',
        ],
        25 => [
            'id'            => 25,
            'no'            => 'HW25',
            'name'          => '含硒废物',
        ],
        26 => [
            'id'            => 26,
            'no'            => 'HW26',
            'name'          => '含镉废物',
        ],
        27 => [
            'id'            => 27,
            'no'            => 'HW27',
            'name'          => '含锑废物',
        ],
        28 => [
            'id'            => 28,
            'no'            => 'HW28',
            'name'          => '含碲废物',
        ],
        29 => [
            'id'            => 29,
            'no'            => 'HW29',
            'name'          => '含汞废物',
        ],
        30 => [
            'id'            => 30,
            'no'            => 'HW30',
            'name'          => '含铊废物',
        ],
        31 => [
            'id'            => 31,
            'no'            => 'HW31',
            'name'          => '含铅废物',
        ],
        32 => [
            'id'            => 32,
            'no'            => 'HW32',
            'name'          => '无机氟化物废物',
        ],
        33 => [
            'id'            => 33,
            'no'            => 'HW33',
            'name'          => '无机氰化物废物',
        ],
        34 => [
            'id'            => 34,
            'no'            => 'HW34',
            'name'          => '废酸',
        ],
        35 => [
            'id'            => 35,
            'no'            => 'HW35',
            'name'          => '废碱',
        ],
        36 => [
            'id'            => 36,
            'no'            => 'HW36',
            'name'          => '石棉废物',
        ],
        37 => [
            'id'            => 37,
            'no'            => 'HW37',
            'name'          => '有机磷化合物废物',
        ],
        38 => [
            'id'            => 38,
            'no'            => 'HW38',
            'name'          => '有机氰化物废物',
        ],
        39 => [
            'id'            => 39,
            'no'            => 'HW39',
            'name'          => '含酚废物',
        ],
        40 => [
            'id'            => 40,
            'no'            => 'HW40',
            'name'          => '含醚废物',
        ],
        45 => [
            'id'            => 45,
            'no'            => 'HW45',
            'name'          => '含有机卤化物废物',
        ],
        46 => [
            'id'            => 46,
            'no'            => 'HW46',
            'name'          => '含镍废物',
        ],
        47 => [
            'id'            => 47,
            'no'            => 'HW47',
            'name'          => '含钡废物',
        ],
        48 => [
            'id'            => 48,
            'no'            => 'HW48',
            'name'          => '有色金属采选和冶炼废物',
        ],
        49 => [
            'id'            => 49,
            'no'            => 'HW49',
            'name'          => '其他废物',
        ],
        50 => [
            'id'            => 50,
            'no'            => 'HW50',
            'name'          => '废催化剂',
        ],

    ];

    /**
     * PPE
     */
    const PPE_OBJECT = [
        1 => [
            'id' => 1,
            'name' => '头部防护类',
        ],
        2 => [
            'id' => 2,
            'name' => '呼吸防护类',
        ],
        3 => [
            'id' => 3,
            'name' => '眼面防护类',
        ],
        4 => [
            'id' => 4,
            'name' => '听力防护类',
        ],
        5 => [
            'id' => 5,
            'name' => '足部防护类',
        ],
        6 => [
            'id' => 6,
            'name' => '手部防护类',
        ],
        7 => [
            'id' => 7,
            'name' => '身体防护类',
        ],
        8 => [
            'id' => 8,
            'name' => '高处防护类',
        ],
        9 => [
            'id' => 9,
            'name' => '护肤用品',
        ],
    ];

    /**
     * 职业病分类
     */
    const OD_KIND_OBJECT = [
        1  => '职业性尘肺病及其他呼吸系统疾病',
        2  => '职业性皮肤病',
        3  => '职业性眼病',
        4  => '职业性耳鼻喉口腔疾病',
        5  => '职业性化学中毒',
        6  => '物理因素所致职业病',
        7  => '职业性放射性疾病',
        8  => '职业性传染病',
        9  => '职业性肿瘤',
        10 => '其他职业病',
    ];

    /*
     * 化学品类型
     */
    const CHEMICAL_OBJECT = [
        1 => '爆炸品',
        2 => '压缩气体和液化气体',
        3 => '易燃液体',
        4 => '易燃固体、自燃物品和遇湿易燃物品',
        5 => '氧化剂和有机过氧化物',
        6 => '有毒品',
        7 => '放射性物品',
        8 => '腐蚀品'
    ];

    /**
     * 特种作业操作证书类别
     */
    const SPECIAL_WORK_OBJECT = [
        1 => [
            'id'            => 1,
            'name'          => '电工作业',
            'desc'          => '低压电工作业;高压安装修造作业;高压调试试验作业;防爆电气作业',
        ],
        2 => [
            'id'            => 2,
            'name'          => '焊接与热切割作',
            'desc'          => '业气焊与气割作业;焊条电弧焊与碳弧气刨作业;埋弧焊作业;气体保护焊作业;等离子切割作业;电渣焊作业;电阻焊作业;钎焊作业;特殊焊接与热切割作业',
        ],
        3 => [
            'id'            => 3,
            'name'          => '起重机械作业',
            'desc'          => '起重司索;起重指挥;起重机司机（桥式类型起重机、门座类型起重机、塔式类型起重机、臂架式类型起重机、流动式类型起重机）；起重机械安装改造作业；起重机械维修作业；起重机械操作作业',
        ],
        4 => [
            'id'            => 4,
            'name'          => '企业内机动车辆作业',
            'desc'          => '叉车驾驶作业;装载、挖掘机械驾驶作业；筑路机械驾驶作业；自卸运输机械驾驶作业；推土机械驾驶作业；蓄电池车驾驶作业；企业内汽车驾驶作业；企业内拖拉机驾驶作业；企业内机动车辆维修作业',
        ],
        5 => [
            'id'            => 5,
            'name'          => '高处作业',
            'desc'          => '登高架设作业；高处装修与清洁作业',
        ],
        6 => [
            'id'            => 6,
            'name'          => '锅炉作业',
            'desc'          => '锅炉运行操作作业；锅炉水处理作业；锅炉安装修理作业',
        ],
        7 => [
            'id'            => 7,
            'name'          => '压力容器作业',
            'desc'          => '固定式压力容器运行操作作业；移动式压力容器操作作业；医用氧舱作业',
        ],
        8 => [
            'id'            => 8,
            'name'          => '制冷与空调作业',
            'desc'          => '压缩式制冷与空调设备运行操作作业；吸收式制冷空调设备运行操作作业；制冷与空调设备安装修理作业；小型制冷与空调装置安装修理作业;',
        ],
        9 => [
            'id'            => 9,
            'name'          => '爆破作业',
            'desc'          => '岩土爆破作业；拆除爆破作业；煤矿井下爆破作业；特殊爆破作业',
        ],
        10 => [
            'id'            => 10,
            'name'          => '采掘(剥)作业',
            'desc'          => '采煤机司机；掘进机司机；耙岩机司机；凿岩机司机',
        ],
        11 => [
            'id'            => 11,
            'name'          => '危险化学品作业',
            'desc'          => '易燃易爆危险化学品作业（易燃易爆危险化学品生产操作作业、易燃易爆危险化学品押运作业、易燃易爆危险化学品废弃处理作业、易燃易爆危险化学品、易燃易爆危险化学品储存作业）；毒性危险化学品作业（毒性危险化学品生产操作作业、毒性危险化学品押运作业;毒性危险化学品废弃处理作业、毒性危险化学品设备检修作业、毒性危险化学品储存作业）；燃毒危险化学品作业（燃毒危险化学品生产操作作业、燃毒危险化学品押运作业、燃毒危险化学品废弃处理作业、燃毒危险化学品设备检修作业、燃毒危险化学品储存作业）',
        ],
        12 => [
            'id'            => 12,
            'name'          => '矿山作业',
            'desc'          => '矿井通风作业（煤矿通风安全监测监控作业、煤矿瓦斯检查作业、金属非金属矿井通风作业）金属非金属矿山尾矿坝作业；矿山安全检查作业；矿山提升运输作业（矿山主提升机操作作业、金属非金属矿山井下绞车操作作业、金属非金属矿山装载机械设备操作作业）；金属非金属矿山敲帮问顶作业；矿山应急救护作业',
        ],
        13 => [
            'id'            => 13,
            'name'          => '烟花爆竹作业',
            'desc'          => '烟花爆竹制作作业；烟花爆竹生产运输作业；烟花爆竹押运作业；烟花爆竹储存作业;烟花爆竹废弃处理作业；烟花爆竹专业燃放作业；烟花爆竹生产装置维护与检修作业',
        ],
        14 => [
            'id'            => 14,
            'name'          => '民用爆破器材作业',
            'desc'          => '民爆器材生产操作作业（单质炸药加工作业、混药作业、制药作业、装药作业、装配作业）；民爆器材生产运输作业；民爆器材押运作业；民爆器材储存作业；民爆器材性能测试与检验作业；民爆器材废弃处理作业；民爆器材生产装置维护与检修作业',
        ],
        15 => [
            'id'            => 15,
            'name'          => '电梯作业',
            'desc'          => '电梯安装改造作业；电梯维修作业；电梯操作作业',
        ],
        16 => [
            'id'            => 16,
            'name'          => '压力管道运行操作作业',
            'desc'          => '长输管道操作作业；公用管道操作作业；工业管道操作作业 客运索道作业 客运索道安装改造作业；客运索道维修作业；客运索道运行操作作业',
        ],
        17 => [
            'id'            => 17,
            'name'          => '大型游乐设施作业',
            'desc'          => '大型游乐设施安装改造作业；大型游乐设施维修作业；大型游乐设施运行操作作业',
        ]
    ];

    /*
     *职业禁忌症
     */
    const TABOO_TYPE = [
        1 => [
            'harm_id' => 1,
            'pre_work' => '(1)贫血(2)卟啉病(3)多发性周围神经病',
            'at_work' => '(1)贫血(2)卟啉病(3)多发性周围神经病'
        ],
        2 => [
            'harm_id' => 2,
            'pre_work' => '(1)中枢神经系统器质性疾病(2)严重自主神经功能紊乱性疾病(3)各类精神疾病',
            'at_work' => '(1)中枢神经系统器质性疾病(2)严重自主神经功能紊乱性疾病(3)各类精神疾病'
        ],
        3 => [
            'harm_id' => 3,
            'pre_work' => '(1) 中枢神经系统器质性疾病(2) 各类精神病(3) 慢性口腔炎(4) 慢性肾脏疾病',
            'at_work' => '(1) 中枢神经系统器质性疾病(2) 各类精神病(3) 慢性口腔炎(4) 慢性肾脏疾病'
        ],
        4 => [
            'harm_id' => 4,
            'pre_work' => '(1)中枢神经系统器质性疾病(2)各类精神病(3)严重自主神经功能紊乱性疾病',
            'at_work' => '(1)中枢神经系统器质性疾病(2)各类精神病(3)严重自主神经功能紊乱性疾病'
        ],
        5 => [
            'harm_id' => 5,
            'pre_work' => '(1)活动性肺结核(2)慢性阻塞性肺病(3)支气管哮喘(4)支气管扩张(5)慢性间质性肺病',
            'at_work' => '(1)活动性肺结核(2)慢性阻塞性肺病(3)支气管哮喘(4)支气管扩张(5)慢性间质性肺病'
        ],
        6 => [
            'harm_id' => 6,
            'pre_work' => '(1)慢性肾小管-间质性肾病(2)慢性阻塞性肺病(3)支气管哮喘(4)慢性间质性肺病(5)原发性骨质疏松症',
            'at_work' => '(1)慢性肾小管-间质性肾病(2)慢性阻塞性肺病(3)支气管哮喘(4)慢性间质性肺病(5)原发性骨质疏松症'
        ],
        7 => [
            'harm_id' => 7,
            'pre_work' => '(1)慢性皮炎(2)慢性肾炎(3)慢性鼻炎(4)慢性阻塞性肺病(5)慢性间质性肺病',
            'at_work' => '(1)慢性皮炎(2)慢性肾炎(3)慢性鼻炎(4)慢性阻塞性肺病(5)慢性间质性肺病'
        ],
        8 => [
            'harm_id' => 8,
            'pre_work' => '甲状腺功能亢进症',
            'at_work' => "甲状腺功能亢进症"
        ],
        9 => [
            'harm_id' => 9,
            'pre_work' => '(1)慢性肝炎(2)周围神经病(3)严重慢性皮肤病',
            'at_work' => '(1)慢性肝炎(2)周围神经病(3)严重慢性皮肤病'
        ],
        10 => [
            'harm_id' => 10,
            'pre_work' => '(1)贫血(2)慢性肾小管-间质性肾病(3)慢性肾小球肾炎',
            'at_work' => '(1)贫血(2)慢性肾小管-间质性肾病(3)慢性肾小球肾炎'
        ],
        11 => [
            'harm_id' => 11,
            'pre_work' => '(1)慢性牙周炎、牙本质病变(不包括龋齿）(2)下颌骨疾病(3)慢性肝炎(4)慢性肾炎',
            'at_work' => '(1)慢性牙周炎、牙本质病变(不包括龋齿）(2)下颌骨疾病(3)慢性肝炎(4)慢性肾炎'
        ],
        12 => [
            'harm_id' => 12,
            'pre_work' => '(1)支气管扩张(2)慢性阻塞性肺病(3)慢性间质性肺病(4)心肌病(5)慢性肝炎',
            'at_work' => '(1)支气管扩张(2)慢性阻塞性肺病(3)慢性间质性肺病(4)心肌病(5)慢性肝炎'
        ],
        13 => [
            'harm_id' => 13,
            'pre_work' => '(1)钾代谢障碍(2)肌肉系统疾病(3)心肌病',
            'at_work' => '(1)钾代谢障碍(2)肌肉系统疾病(3)心肌病'
        ],
        14 => [
            'harm_id' => 14,
            'pre_work' => '(1)慢性阻塞性肺病(2)慢性间质性肺病(3)支气管哮喘(4)支气管扩张',
            'at_work' => '(1)慢性阻塞性肺病(2)慢性间质性肺病(3)支气管哮喘(4)支气管扩张'
        ],
        15 => [
            'harm_id' => 15,
            'pre_work' => '(1)中枢神经系统器质性疾病(2)慢性肝炎(3)慢性肾炎(4)钾代谢障碍',
            'at_work' => '(1)中枢神经系统器质性疾病(2)慢性肝炎(3)慢性肾炎(4)钾代谢障碍'
        ],
        16 => [
            'harm_id' => 16,
            'pre_work' => '(1)中枢神经系统器质性疾病(2)多发性周围神经病(3)各类精神病(4)慢性肝炎(5)视神经病或视网膜病(6)严重脱发',
            'at_work' => '(1)中枢神经系统器质性疾病(2)多发性周围神经病(3)各类精神病(4)慢性肝炎(5)视神经病或视网膜病(6)严重脱发'
        ],
        17 => [
            'harm_id' => 17,
            'pre_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)慢性间质性肺病',
            'at_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)慢性间质性肺病'
        ],
        18 => [
            'harm_id' => 18,
            'pre_work' => '(1)地方性氟病(2)骨关节疾病',
            'at_work' => '(1)地方性氟病(2)骨关节疾病'
        ],
        19 => [
            'harm_id' => 19,
            'pre_work' => '(1)血常规检出有如下异常者：白细胞计数低于4.5×109/L；血小板计数低于8×1010/L；红细胞计数男性低于4×1012/L，女性低于3.5×1012/L或血红蛋白定量男性低于120g/L，女性低于110g/L
            (2)造血系统疾病如各种类型的贫血、白细胞减少症和粒细胞缺乏症、血红蛋白病、血液肿瘤以及凝血障碍疾病等；(3)脾功能亢进',
            'at_work' => '脾功能亢进'
        ],
        20 => [
            'harm_id' => 20,
            'pre_work' => '(1)周围神经病(2)糖尿病(3)视网膜病变',
            'at_work' => '(1)周围神经病(2)糖尿病(3)视网膜病变'
        ],
        21 => [
            'harm_id' => 21,
            'pre_work' => '(1)慢性肝炎(2)慢性肾炎',
            'at_work' => '慢性肾炎'
        ],
        22 => [
            'harm_id' => 22,
            'pre_work' => '视网膜及视神经病',
            'at_work' => '视网膜及视神经病'
        ],
        23 => [
            'harm_id' => 23,
            'pre_work' => '(1)过敏性皮肤疾病(2)神经系统器质性疾病',
            'at_work' => '(1)过敏性皮肤疾病(2)神经系统器质性疾病'
        ],
        24 => [
            'harm_id' => 24,
            'pre_work' => '(1)慢性间质性肺病(2)慢性阻塞性肺病(3)中枢神经系统器质性疾病',
            'at_work' => '(1)慢性间质性肺病(2)慢性阻塞性肺病(3)中枢神经系统器质性疾病'
        ],
        25 => [
            'harm_id' => 25,
            'pre_work' => '(1)中枢神经系统器质性疾病(2)慢性肝炎(3)慢性肾炎(4)心肌病',
            'at_work' => '(1)中枢神经系统器质性疾病(2)慢性肝炎(3)慢性肾炎(4)心肌病'
        ],
        26 => [
            'harm_id' => 26,
            'pre_work' => '(1)多发性周围神经病(2)糖尿病',
            'at_work' => '(1)多发性周围神经病(2)糖尿病'
        ],
        27 => [
            'harm_id' => 27,
            'pre_work' => '(1)贫血(2)慢性肝炎(3)慢性肾炎(4)血清葡萄糖-6-磷酸脱氢酶缺乏症',
            'at_work' => '(1)贫血(2)慢性肝炎(3)慢性肾炎(4)血清葡萄糖-6-磷酸脱氢酶缺乏症'
        ],
        28 => [
            'harm_id' => 28,
            'pre_work' => '(1)慢性肝炎(2)眼晶状体混浊，白内障(3)贫血',
            'at_work' => "贫血"
        ],
        29 => [
            'harm_id' => 29,
            'pre_work' => '(1)膀胱癌(2)尿脱落细胞检查巴氏分级国际标准Ⅳ级及以上(3)慢性泌尿系统感染',
            'at_work' => '(1)膀胱癌(2)尿脱落细胞检查巴氏分级国际标准Ⅳ级及以上(3)慢性泌尿系统感染'
        ],
        30 => [
            'harm_id' => 30,
            'pre_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)慢性间质性肺病(4)支气管扩张',
            'at_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)慢性间质性肺病(4)支气管扩张'
        ],
        31 => [
            'harm_id' => 31,
            'pre_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)支气管扩张(4)慢性间质性肺病',
            'at_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)支气管扩张(4)慢性间质性肺病'
        ],
        32 => [
            'harm_id' => 32,
            'pre_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)支气管扩张(4)慢性间质性肺病',
            'at_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)支气管扩张(4)慢性间质性肺病'
        ],
        33 => [
            'harm_id' => 33,
            'pre_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)慢性间质性肺病(4)支气管扩张',
            'at_work' => "(1)慢性阻塞性肺病(2)支气管哮喘(3)慢性间质性肺病(4)支气管扩张"
        ],
        34 => [
            'harm_id' => 34,
            'pre_work' => '(1)慢性阻塞性肺病(2)慢性间质性肺病(3)支气管哮喘(4)支气管扩张',
            'at_work' => '(1)慢性阻塞性肺病(2)慢性间质性肺病(3)支气管哮喘(4)支气管扩张'
        ],
        35 => [
            'harm_id' => 35,
            'pre_work' => '(1)慢性间质性肺病(2)慢性阻塞性肺病(3)中枢神经系统器质性疾病',
            'at_work' => '(1)慢性间质性肺病(2)慢性阻塞性肺病(3)中枢神经系统器质性疾病'
        ],
        36 => [
            'harm_id' => 36,
            'pre_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)支气管扩张(4)慢性间质性肺病',
            'at_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)支气管扩张(4)慢性间质性肺病'
        ],
        37 => [
            'harm_id' => 37,
            'pre_work' => '(1)中枢神经系统器质性疾病(2)心肌病',
            'at_work' => '(1)中枢神经系统器质性疾病(2)心肌病'
        ],
        38 => [
            'harm_id' => 38,
            'pre_work' => '(1)中枢神经系统器质性疾病(2)伴肺功能损害的呼吸系统疾病(3)器质性心脏病',
            'at_work' => '(1)中枢神经系统器质性疾病(2)伴肺功能损害的呼吸系统疾病(3)器质性心脏病'
        ],
        39 => [
            'harm_id' => 39,
            'pre_work' => '(1)慢性肝炎(2)类风湿关节炎',
            'at_work' => '(1)职业性慢性氯乙烯中毒（见GBZ90）(2)氯乙烯所致肝血管肉瘤（见GBZ94）'
        ],
        40 => [
            'harm_id' => 40,
            'pre_work' => '(1)慢性肝炎(2)慢性肾炎(3)过敏性皮肤病(4)中枢神经系统器质性疾病',
            'at_work' => '(1)慢性肝炎(2)慢性肾炎(3)过敏性皮肤病(4)中枢神经系统器质性疾病'
        ],
        41 => [
            'harm_id' => 41,
            'pre_work' => '(1)周围神经病(2)糖尿病',
            'at_work' => '(1)周围神经病(2)糖尿病'
        ],
        42 => [
            'harm_id' => 42,
            'pre_work' => '(1)慢性肝炎(2)严重脱发',
            'at_work' => '(1)慢性肝炎(2)严重脱发'
        ],
        43 => [
            'harm_id' => 43,
            'pre_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)慢性间质性肺病(4)心肌病',
            'at_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)慢性间质性肺病(4)心肌病'
        ],
        44 => [
            'harm_id' => 44,
            'pre_work' => '',
            'at_work' => ''
        ],
        45 => [
            'harm_id' => 45,
            'pre_work' => '慢性肝炎',
            'at_work' => '慢性肝炎'
        ],
        46 => [
            'harm_id' => 46,
            'pre_work' => '(1)慢性肝炎(2)中枢神经系统器质性疾病',
            'at_work' => '(1)慢性肝炎(2)中枢神经系统器质性疾病'
        ],
        47 => [
            'harm_id' => 47,
            'pre_work' => '(1)慢性肾炎(2)血液系统疾病',
            'at_work' => '(1)慢性肾炎(2)血液系统疾病'
        ],
        48 => [
            'harm_id' => 48,
            'pre_work' => '甲状腺机能亢进症',
            'at_work' => '甲状腺机能亢进症'
        ],
        49 => [
            'harm_id' => 49,
            'pre_work' => '(1)慢性阻塞性肺病(2)慢性间质性肺病(3)支气管哮喘(4)支气管扩张',
            'at_work' => '(1)慢性阻塞性肺病(2)慢性间质性肺病(3)支气管哮喘(4)支气管扩张'
        ],
        50 => [
            'harm_id' => 50,
            'pre_work' => '(1)神经系统器质性疾病(2)糖尿病(3)过敏性皮肤病',
            'at_work' => '(1)神经系统器质性疾病(2)糖尿病(3)过敏性皮肤病'
        ],
        51 => [
            'harm_id' => 51,
            'pre_work' => '(1)慢性肝炎(2)中枢神经系统器质性疾病',
            'at_work' => '(1)慢性肝炎(2)中枢神经系统器质性疾病'
        ],
        52 => [
            'harm_id' => 52,
            'pre_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)慢性间质性肺病',
            'at_work' => '(1)慢性阻塞性肺病(2)支气管哮喘(3)慢性间质性肺病'
        ],
        53 => [
            'harm_id' => 53,
            'pre_work' => '(1)神经系统器质性疾病(2)全血胆碱酯酶活性明显低于正常者',
            'at_work' => '(1)神经系统器质性疾病(2)全血胆碱酯酶活性明显低于正常者'
        ],
        54 => [
            'harm_id' => 54,
            'pre_work' => '(1)中枢神经系统器质性疾病(2)慢性阻塞性肺病(3)支气管扩张(4)活动性肺结核病(5)支气管哮喘',
            'at_work' => '(1)中枢神经系统器质性疾病(2)慢性阻塞性肺病(3)支气管扩张(4)活动性肺结核病(5)支气管哮喘'
        ],
        55 => [
            'harm_id' => 55,
            'pre_work' => '(1)多发性周围神经病(2)中枢神经系统器质性疾病(3)过敏性皮炎',
            'at_work' => '(1)多发性周围神经病(2)中枢神经系统器质性疾病(3)过敏性皮炎'
        ],
        56 => [
            'harm_id' => 56,
            'pre_work' => '(1)牙本质过敏(2)因反流性食道炎和胃、十二指肠溃疡等非职业性因素致牙酸蚀病(3)慢性阻塞性肺病(4)支气管哮喘',
            'at_work' => 'a.慢性阻塞性肺病b.支气管哮喘'
        ],
        57 => [
            'harm_id' => 57,
            'pre_work' => '(1)致喘物过敏和支气管哮喘(2)伴肺功能损害的心血管及呼吸系统疾病',
            'at_work' => '伴肺功能损害的心血管系统疾病'
        ],
        58 => [
            'harm_id' => 58,
            'pre_work' => '(1)活动性肺结核病(2)慢性阻塞性肺病(3)慢性间质性肺病(4)伴肺功能损害的疾病',
            'at_work' => '(1)活动性肺结核病(2)慢性阻塞性肺病(3)慢性间质性肺病(4)伴肺功能损害的疾病'
        ],
        59 => [
            'harm_id' => 59,
            'pre_work' => '(1)活动性肺结核病(2)慢性阻塞性肺病(3)慢性间质性肺病(4)伴肺功能损害的疾病',
            'at_work' => '(1)活动性肺结核病(2)慢性阻塞性肺病(3)慢性间质性肺病(4)伴肺功能损害的疾病'
        ],
        60 => [
            'harm_id' => 60,
            'pre_work' => '(1)活动性肺结核病(2)慢性阻塞性肺病(3)慢性间质性肺病(4)伴肺功能损害的疾病',
            'at_work' => '(1)活动性肺结核病(2)慢性阻塞性肺病(3)慢性间质性肺病(4)伴肺功能损害的疾病'
        ],
        61 => [
            'harm_id' => 61,
            'pre_work' => '(1)活动性肺结核病(2)慢性阻塞性肺病(3)慢性间质性肺病(4)伴肺功能损害的疾病',
            'at_work' => '(1)活动性肺结核病(2)慢性阻塞性肺病(3)慢性间质性肺病(4)伴肺功能损害的疾病'
        ],
        62 => [
            'harm_id' => 62,
            'pre_work' => '(1)活动性肺结核病(2)慢性阻塞性肺病(3)伴肺功能损害的疾病',
            'at_work' => '(1)活动性肺结核病(2)慢性阻塞性肺病(3)伴肺功能损害的疾病'
        ],
        63 => [
            'harm_id' => 63,
            'pre_work' => '(1)各种原因引起永久性感音神经性听力损失（500Hz、1000Hz和2000Hz中任一频率的纯音气导听阈＞25dBHL）(2)中度以上传导性耳聋(3)双耳高频（3000Hz，4000Hz，6000Hz）平均听阈≥40dB(4)Ⅱ期和Ⅲ高血压(5)器质性心脏病',
            'at_work' => '噪声易感者（噪声环境下工作1年，双耳3000Hz、4000Hz、6000Hz中任意频率听力损失≥65dBHL）'
        ],
        64 => [
            'harm_id' => 64,
            'pre_work' => '(1)周围神经系统器质性疾病(2)雷诺病',
            'at_work' => '(1)周围神经系统器质性疾病(2)雷诺病'
        ],
        65 => [
            'harm_id' => 65,
            'pre_work' => '(1)Ⅱ期及Ⅲ期高血压(2)活动性消化性溃疡(3)慢性肾炎(4)未控制的甲亢',
            'at_work' => '(1)Ⅱ期及Ⅲ期高血压(2)活动性消化性溃疡(3)慢性肾炎(4)未控制的甲亢'
        ],
        66 => [
            'harm_id' => 66,
            'pre_work' => '(1)神经、精神、循环、呼吸、泌尿、内分泌、血液、骨关节及消化系统器质性疾病；
(2)头颅变形、胸廓畸形、肋骨骨折史，慢性腰腿痛、脊椎病变、多发性肝肾及骨囊肿、多发性脂肪瘤、瘢痕体质、消化泌尿结石、脱肛、肛瘘、经常出血的痔疮、各类隐睾及颅脑、胸腔及腹腔手术史等外科疾病
(3)眼、耳、鼻、喉及前庭器官的器质性疾病；
(4)曾发生不明原因昏厥者，未治愈的疝气、过敏体质、口吃、明显的皮肤病及广泛的皮肤疤痕
(5)加压试验不合格或氧敏感试验阳性者（见附录E）
(6)年龄超过50岁者',
            'at_work' => '(1)神经、精神、循环、呼吸、泌尿、内分泌、血液、骨关节及消化系统器质性疾病；
(2)头颅变形、胸廓畸形、肋骨骨折史，慢性腰腿痛、脊椎病变、多发性肝肾及骨囊肿、多发性脂肪瘤、瘢痕体质、消化泌尿结石、脱肛、肛瘘、经常出血的痔疮、各类隐睾及颅脑、胸腔及腹腔手术史等外科疾病
(3)眼、耳、鼻、喉及前庭器官的器质性疾病；
(4)曾发生不明原因昏厥者，未治愈的疝气、过敏体质、口吃、明显的皮肤病及广泛的皮肤疤痕
(5)加压试验不合格或氧敏感试验阳性者（见附录E）
(6)年龄超过50岁者'
        ],
        67 => [
            'harm_id' => 67,
            'pre_work' => '(1)活动性角膜疾病(2)白内障(3)面、手背和前臂等暴露部位严重的皮肤病(4)白化病',
            'at_work' => '(1)活动性角膜疾病(2)白内障(3)面、手背和前臂等暴露部位严重的皮肤病(4)白化病'
        ],
        68 => [
            'harm_id' => 68,
            'pre_work' => '(1)神经系统器质性疾病(2)白内障',
            'at_work' => '(1)神经系统器质性疾病(2)白内障'
        ],
        69 => [
            'harm_id' => 69,
            'pre_work' => '(1)慢性肝炎(2)骨关节疾病(3)生殖系统疾病',
            'at_work' => '(1)慢性肝炎(2)骨关节疾病(3)生殖系统疾病'
        ],
        70 => [
            'harm_id' => 70,
            'pre_work' => '(1)泛发慢性湿疹(2)泛发慢性皮炎',
            'at_work' => '(1)泛发慢性湿疹(2)泛发慢性皮炎'
        ],
        71 => [
            'harm_id' => 71,
            'pre_work' => '(1)癫痫(2)晕厥(近一年内有晕厥发作史)(3)Ⅱ期及Ⅲ期高血压(4)红绿色盲(5)心脏病及心电图明显异常（心律失常）(6)四肢关节运动功能障碍',
            'at_work' => '(1)癫痫(2)晕厥(近一年内有晕厥发作史)(3)Ⅱ期及Ⅲ期高血压(4)红绿色盲(5)心脏病及心电图明显异常（心律失常）(6)四肢关节运动功能障碍'
        ],
        72 => [
            'harm_id' => 72,
            'pre_work' => '(1)高血压(2)恐高症(3)癫痫、晕厥病、梅尼埃病(4)心脏病及心电图明显异常(心律失常)(5)四肢骨关节及运动功能障碍',
            'at_work' => '(1)高血压(2)恐高症(3)癫痫、晕厥病、梅尼埃病(4)心脏病及心电图明显异常(心律失常)(5)四肢骨关节及运动功能障碍'
        ],
        73 => [
            'harm_id' => 73,
            'pre_work' => '(1)红绿色盲(2)Ⅱ期及Ⅲ期高血压(3)癫痫(4)晕厥病(4)双耳语言频段平均听力损失＞25dB(5)心脏病及心电图明显异常(心律失常)',
            'at_work' => '(1)红绿色盲(2)Ⅱ期及Ⅲ期高血压(3)癫痫(4)晕厥病(4)双耳语言频段平均听力损失＞25dB(5)心脏病及心电图明显异常(心律失常)'
        ],
        74 => [
            'harm_id' => 74,
            'pre_work' => '未治愈的肺结核病',
            'at_work' => '未治愈的肺结核病'
        ],
        75 => [
            'harm_id' => 75,
            'pre_work' => '慢性肝炎',
            'at_work' => '慢性肝炎'
        ],
        76 => [
            'harm_id' => 76,
            'pre_work' => '(1)身高  大型机动车驾驶员＜155cm，小型机动车驾驶员＜150cm
(2)远视力（对数视力表）  大型车机动车驾驶员：两裸眼＜4.0，并＜5.0（矫正）；小型车机动车驾驶员：两裸眼＜4.0，并＜4.9（矫正）
(3)红或绿色盲
(4)听力：双耳平均听阈＞30dB（语频纯音气导）
(5)血压：大型车机动车驾驶员：收缩压＞18.7kPa（＞140mmHg）和舒张压＞12kPa（＞90mmHg）；小型车机动车驾驶员：II期及Ⅲ期高血压
(6)深视力：<(－22mm)或>(＋22mm) 
(7)暗适应：＞30s
(8)复视、立体盲、严重视野缺损
(9)器质性心脏病
(12)癫痫
(13)梅尼埃病
(14)眩晕
(15)癔病
(16)震颤麻痹
(17)精神病
(18)痴呆
(19)影响肢体活动的神经系统疾病
(20)吸食、注射毒品、长期服用依赖性精神药品成瘾尚未戒除者',
            'at_work' => '(1)远视力（对数视力表）：大型机动车驾驶员：两裸眼＜4.0，并＜5.0（矫正）；小型机动车驾驶员：两裸眼＜4.0，并＜4.9（矫正）
(2)听力：双耳平均听阈＞30dB（语频纯音气导）
(3)血压：大型机动车驾驶员：收缩压＞18.7kPa（＞140mmHg）和舒张压＞12kPa（＞90mmHg）；小型机动车驾驶员：II期及Ⅲ期高血压
(4)器质性心脏病
(5)癫痫
(6)震颤麻痹
(7)癔病
(8)吸食、注射毒品、长期服用依赖性精神药品成瘾尚未戒除者'
        ],
        77 => [
            'harm_id' => 77,
            'pre_work' => '(1)腕管综合征(2)类风湿关节炎(3)颈椎病(4)矫正视力小于4.5',
            'at_work' => '(1)腕管综合征(2)类风湿关节炎(3)颈椎病(4)矫正视力小于4.5'
        ],
        78 => [
            'harm_id' => 78,
            'pre_work' => '(1)中枢神经系统器质性疾病(2)器质性心脏病(3)高血压(4)慢性阻塞性肺病(5)慢性间质性肺病(6)伴肺功能损害的疾病(7)贫血(8)红细胞增多症',
            'at_work' => '(1)中枢神经系统器质性疾病(2)器质性心脏病(3)高血压(4)慢性阻塞性肺病(5)慢性间质性肺病(6)伴肺功能损害的疾病(7)贫血'
        ],
        79 => [
            'harm_id' => 79,
            'pre_work' => '(1)职业性航空病(2)职业性听力损伤',
            'at_work' => '(1)职业性航空病(2)职业性听力损伤'
        ],

    ];
}
